<a href="https://colab.research.google.com/github/egisahril/Latihan_Machine_learning/blob/main/Logistic_regression(klasifikasi.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Mencari Hubungan antara iklan dengan jumlah pembelian di masyarakat

1. import data

In [1]:
import pandas as pd

# menampilkan data
data = pd.read_csv('Social_Network_Ads.csv')

In [2]:
data.head(6)

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0
5  15728773    Male   27            58000          0

In [4]:
# import data kedua kedalam df
import pandas as pd

df = pd.read_csv('Social_Network_Ads.csv')

In [5]:
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   User ID          400 non-null    int64
 1   Gender           400 non-null    object
 2   Age              400 non-null    int64
 3   EstimatedSalary  400 non-null    int64
 4   Purchased        400 non-null    int64
dtypes: int64(4), object(1)
memory usage: 15.8+ KB

In [8]:
# ada 2 masalah yang harus di selesaikan sebelum ke tahap selanjutnya yaitu.
# 1 menghapus kolom yang tidak diperlukan yaitu columns= User ID
# 2 merubah data string yang ada dalam gender menjadi string bernilai

# 1 menghapus kolom user id dengan drop
data = df.drop(columns=['User ID'])
data.head()

   Gender  Age  EstimatedSalary  Purchased
0    Male   19            19000          0
1    Male   35            20000          0
2  Female   26            43000          0
3  Female   27            57000          0
4    Male   19            76000          0

In [10]:
# 2 merubah data gender dengan teknik one-hot coding dengan pd.get_dummies()
data = pd.get_dummies(data)
data.head()

   Age  EstimatedSalary  Purchased  Gender_Female  Gender_Male
0   19            19000          0              0            1
1   35            20000          0              0            1
2   26            43000          0              1            0
3   27            57000          0              1            0
4   19            76000          0              0            1

In [14]:
# Melakukan pemisahan data atribut dan label atau x dan Y
predictions = ['Age', 'EstimatedSalary', 'Gender_Female', 'Gender_Male']
X = data[predictions]
y = data['Purchased']

In [15]:
# melakukan standarisasi
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
scaler.fit(X)
scaled_data = scaler.transform(X)

In [17]:
# Menjadikan data frame
scaled_data = pd.DataFrame(scaled_data, y, columns= X.columns)
scaled_data.head()

                Age  EstimatedSalary  Gender_Female  Gender_Male
Purchased
0         -1.781797        -1.490046      -1.020204     1.020204
0         -0.253587        -1.460681      -1.020204     1.020204
0         -1.113206        -0.785290       0.980196    -0.980196
0         -1.017692        -0.374182       0.980196    -0.980196
0         -1.781797         0.183751      -1.020204     1.020204

In [20]:
# Membagi data train dan data test
# Dengan memanggil lybrary sklearn.model_selection dengan fungsi train_test_split, 
# menggunakan 80% data train 20% data test, dan menggunakan random_state 
# agar pengambilan data dari tiap masing masing columns bisa seimbang

from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(scaled_data, y, test_size=0.2, random_state=1)

In [23]:
# Melatih model dengan linear_model.LogisticRegression()
from sklearn import linear_model

model = linear_model.LogisticRegression()
model.fit(X_train, y_train)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [24]:
# Menguji akurasi model atau score model
from sklearn.preprocessing import StandardScaler

model.score(X_test, y_test)

0.825